#ifndef FUNCTIONS_TM_H
#define FUNCTIONS_TM_H


  //TM functions
  
  // адрес размещения ключа менеджера в EEPROM
  #define EE_AAD_MANAG 0x0010

  // адрес размещения ключа оператора в EEPROM
  #define EE_AAD_OPER 0x0020
  //-----------------------------------------------------------------------------------------
  
  // число касаний ключом
  static unsigned char touch = 0;

  // признак ключа менеджера (1) или ключа оператора (2)
  static unsigned char chec_TM = 0;
  //-----------------------------------------------------------------------------------------
  unsigned char *p_b;		// указатель на массив

  // данные, считанные с ключа
  static unsigned char data_ROM[8] = {0, 0, 0, 0, 0, 0, 0, 0};

  static unsigned char tm_manag[8];	// ключ менеджера

  static unsigned char tm_oper[8];	// ключ оператора


//*****************************************************************************************
// файл beep.s - функция подачи звукового сигнала при нажатии клавиши
//*****************************************************************************************
//void beep(void);	// функция подачи звукового сигнала при нажатии клавиши
//*****************************************************************************************
// файл Alarm.s - функция подачи звукового сигнала при включении питания
//*****************************************************************************************
//void alarm(unsigned char numb);	// функция подачи звукового сигнала при включении питания
//*****************************************************************************************






//*****************************************************************************************
// файл functions_TM.c - функции обслуживания ключа Touch Memory
//*****************************************************************************************
void inp(void);
void out(void);
void ROM_33(void);
void rd_data_ROM(void);
int calc_CRC(void);
void chec_data_TM(void);
void TM_line(void);
void TM_write_manag(void);
void TM_write_oper(void);
void write_TM_manag(void);
void write_TM_oper(void);
void read_TM_manag(void);
void read_TM_oper(void);
#endif